Todo
====

* [10/10] Spellslinger: Survival
** DONE Fullscreen
** DONE Flexible NPC (Entity) abstraction
** DONE Notices
** DONE IO Scheduler
** DONE Player profile
** DONE Resource pre-loading
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 02:40]--[2013-03-10 Sun 03:16] =>  0:36
   :END:
** DONE Zombies are alerted by player movement 20 squares away
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 20:37]--[2013-03-10 Sun 21:14] =>  0:37
   :END:
** DONE Zombies alerted animation
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 21:25]--[2013-03-10 Sun 21:55] =>  0:30
   :END:
** DONE Score
   :LOGBOOK:
   CLOCK: [2013-03-24 Sun 19:00]--[2013-03-24 Sun 19:21] =>  0:21
   :END:
   Score is awarded for completed levels.  For each level you get:
   time spent in level x zombies in level points.

** DONE High Scores
   :LOGBOOK:
   CLOCK: [2013-03-27 Wed 14:34]--[2013-03-27 Wed 15:21] =>  0:47
   CLOCK: [2013-03-26 Tue 22:05]--[2013-03-26 Tue 22:47] =>  0:42
   CLOCK: [2013-03-25 Mon 21:00]--[2013-03-25 Mon 21:57] =>  0:57
   :END:

* [0/5] Spellslinger 2D
** TODO Distinguish between deterministic and non-deterministic games
** TODO Abstract out engine interface
   :LOGBOOK:
   CLOCK: [2013-07-06 Sat 10:10]--[2013-07-06 Sat 10:47] =>  0:37
   :END:
** TODO GL/GLUT/GLEW-based engine
** TODO Options menu
** TODO Use continuous updating in the game

* Spellsliger: Arena
** TODO Dev console
** TODO Tutorial area
** TODO Geometric arenas
** TODO Promethean Magic
